Revit 2024 API
ConnectionValidationInfo.ManyWarnings Method
 Returns number of warnings generated by reload.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public int ManyWarnings()
Visual Basic
Public Function ManyWarnings As Integer
Visual C++
public:
int ManyWarnings()
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.DisabledDisciplineException |  None of the following disciplines is enabled: Mechanical Electrical Piping.
See Also
ConnectionValidationInfo Class
Autodesk.Revit.DB Namespace